/**
    package: sco_tracers
    filename: response
    author: diogo@gmail.com
    time: 2021/9/14 11:34
**/
package response

import "github.com/gogf/gf/frame/g"

var ReturnCode = g.Map{
	// 基本类型 code
	"201": "error",
	"200": "请求成功",
	"-1":  "系统繁忙，此时请开发者稍候再试",

	// 请求类
	"43001": "需要 GET 请求",
	"43002": "需要 POST 请求",
	"45011": "API 调用太频繁，请稍候再试",
	"48004": "API 接口被封禁，请联系管理员",
	// 数据添加
	"40030": "数据错误,请检查参数",
	"40031": "新建项目失败,请检查参数",
	"40032": "未找到相应的数据",
	"40035": "不合法的参数",
	"40038": "不合法的请求格式",
	"40001": "用户名已经注册",
	"40002": "密码错误",
	"40003": "userToken 错误",
	"40004": "用户被冻结不能登录，请联系管理员！",
	// project
	"30001": "未找到对应的项目",
	"30002": "权限错误",
	// mock
	"40010": "未找到对应的mock",
}
